{
    "versions": [
        {
            "version": "1.2.1",
            "changes": {
                "news": [
                    "Zľavy a služby započítané v tržbách.",
                    "Zľavy a služby započítané vo faktúrach.",
                    "Zľavy a služby započítané v dodacích listoch."
                ],
                "fixed_bugs": [
                    "Opravená chyba s označovaním objednávok."
                ]
            }
        },
        {
            "version": "1.2.2",
            "changes": {
                "news": [
                    "Pridaná možnosť nastavenia stavu objednávky."
                ],
                "fixed_bugs": [
                    "Odstránený problém s označením objednávok.",
                    "Odstránený problém s upravovaním faktúr."
                ]
            }
        },
        {
            "version": "1.2.3",
            "changes": {
                "news": [
                    "Pridané funkcie skladového hospodárstva.",
                    "Pridaná funkcia vytvárania výrobkov a služieb priamo v objednávke.",
                    "Pridaná funkcia vytvárania zákazníkov priamo v objednávke.",
                    "Možnosť nastaviť hmotnosť výrobku.",
                    "Zobrazenie hmotnosti celej objednávky.",
                    "Zmena navigácie medzi jednotlivými výrobkami."
                ],
                "fixed_bugs": [
                    "Odstránený problém so zobrazovaním vymazaných výrobkov pri vytváraní objednávky."
                ]
            }
        },
        {
            "version": "1.2.4",
            "changes": {
                "news": [
                    "Hromadná zmena DPH hladín."
                ],
                "fixed_bugs": []
            }
        },
        {
            "version": "1.2.6",
            "changes": {
                "news": [],
                "fixed_bugs": [
                    "Opravený problém s označovaním.",
                    "Opravený problém s vyhľadávaním vo faktúrach."
                ]
            }
        },
        {
            "version": "1.2.7",
            "changes": {
                "news": [
                    "Zmena zachytávania a riešenie errorov."
                ],
                "fixed_bugs": []
            }
        },
        {
            "version": "1.2.8",
            "changes": {
                "news": [
                    "Zmena cenníka priamo pri vytváraní objednávky, bez vymazania už pridaných produktov."
                ],
                "fixed_bugs": [
                    "Oprava číslovanie faktúr podľa obdobia fakturácie.",
                    "Oprava sadzieb DPH v dodacích listoch, po ich zmene.",
                    "Použitie správneho cenníka pri kopírovaní objednávok."
                ]
            }
        },
        {
            "version": "1.2.9",
            "changes": {
                "news": [],
                "fixed_bugs": [
                    "Odstránie chyby, kedy pri kopírovaní objednávky, na základe ktorej už bola vystavená faktúra, tak sa táto skopírovaná objednávka zobrazila na faktúre s pôvodnou objednávkou."
                ]
            }
        },
        {
            "version": "1.2.10",
            "changes": {
                "news": [
                    "Zobrazenie všetkých zmien v aplikácii po kliknutí na ikonu v hornej lište.",
                    "Možnosť zobrazenia historického stavu skladu.",
                    "Zobrazenie štatistík príjmov, výdajov a zostatkov tovaru na sklade.",
                    "Automatická tvorba podskladových kariet na základe ich ceny pri naskladňovaní.",
                    "Zobrazenie skladových kariet spolu s podskladovými kartami.",
                    "Úprava vzhľadu kariet zobrazujúcich pohyby na sklade.",
                    "Prednastavený rozsah 30 dní pri pohyboch na sklade.",
                    "Intuitívnejší proces tvorby pohybov na sklade.",
                    "Zakázaná možnosť zmeny dátumu a typu pohybu už vo vytvorenom pohybe na sklade."
                ],
                "fixed_bugs": [
                    "Zaokrúhľovanie stavu zásob v sklade na 3 desatinné miesta."
                ]
            }
        },
        {
            "version": "1.2.11",
            "changes": {
                "news": [],
                "fixed_bugs": [
                    "Odstránenie chyby pri kopírovaní objednávok. Program pri neprepojených produktoch so skladovými kartami nesprávne vyhodnocoval, že na sklade nie je dostatok zásob."
                ]
            }
        },
        {
            "version": "1.2.12",
            "changes": {
                "news": [
                    "Vytvorenie novej skupiny výrobkov po stlačení ENTER.",
                    "Zoradenie skupiny výrobkov na základe \"rozsahu od\".",
                    "Možnosť prepojenia názvu skladovej karty s názvom výrobku."
                ],
                "fixed_bugs": [
                    "Pridaná možnosť scrollovania tabuľky so skupinami výrobkov."
                ]
            }
        },
        {
            "version": "1.2.13",
            "changes": {
                "news": [
                    "Možnosť posúvania medzi textovými poliami pri vytváraní objednávky alebo skladového pohybu pomocou šípok na klávesnici."
                ],
                "fixed_bugs": [
                    "Automatická zmena stavu skladu na základe objednávky."
                ]
            }
        },
        {
            "version": "1.2.14",
            "changes": {
                "news": [
                    "Zmena zobrazenia výrobkov, skupín a práce s nimi.",
                    "V prípade, ak sú výrobky prepojené so skladovými kartami, je možné vybrať výrobky na naskladnenie označením viacerých položiek z výrobkov rozdelených podľa vášho rozdelenia.",
                    "Zmena vzhľadu objednávok pre lepšiu vizuálnu indikáciu nastaveného statusu objednávky."
                ],
                "fixed_bugs": []
            }
        },
        {
            "version": "1.2.15",
            "changes": {
                "news": [],
                "fixed_bugs": [
                    "Hot fix: Zobrazenie tlačidiel na úpravu cenníkov."
                ]
            }
        },
        {
            "version": "1.2.16",
            "changes": {
                "news": [
                    "Zobrazenie podrobných informácií o zákazníkovi pri objednávke po kliknutí na jeho meno/názov."
                ],
                "fixed_bugs": []
            }
        },
        {
            "version": "1.2.17",
            "changes": {
                "news": [
                    "Vizuálna zmena zobrazenia skladových kariet spolu s nasledujúcimi vylepšeniami: 1. Zobrazenie podskladových kariet spolu s vysvetlivkami. 2. Zobrazenie štatistík pohybov. 3. Zobrazenie pohybov.",
                    "Možnosť zoradiť skladové karty na základe množstva.",
                    "Možnosť filtrovať pohyby podľa skladovej karty.",
                    "Možnosť pridať poznámku k objednávke.",
                    "Zobrazenie chystaných zmien ešte pred aktualizáciou.",
                    "Možnosť odmietnuť aktualizáciu a nezobrazovať výzvu na jej vykonanie.",
                    "Možnosť vyhľadať a vykonať aktualizácie v nastaveniach aplikácie."
                ],
                "fixed_bugs": [
                    "Automaticky nastavená preferovaná daňová hladina pri tvorbe skladovej karty.",
                    "Správne zobrazenie skladových kariet s nedostatočným množstvom.",
                    "Nezobrazovanie skladových kariet, ktoré boli vymazané pri tvorbe nového skladového pohybu."
                ]
            }
        },
        {
            "version": "1.2.18",
            "changes": {
                "news": [
                    "Možnosť zadať telefónne číslo s predvoľbou (+421...).",
                    "Nastavenie niektorých textových polí ako voliteľných namiesto povinných pri zákazníkovi, spoločnosti a osobných informáciách.",
                    "Automatické nastavenie typu platby, typu faktúry a doby splatnosti pri vytváraní zákazníka.",
                    "Zmena zobrazovania adresy zákazníka. Po novom: Ulica, PSČ, Mesto.",
                    "Pridaná možnosť nastaviť štát zákazníka.",
                    "Zobrazenie dostupného množstva na sklade pri tvorbe objednávky, ak je výrobok prepojený so skladovou kartou.",
                    "Prehľadnejšie zaokrúhľovanie dostupného množstva na sklade. Doteraz sa zobrazovalo napr. 1.200 kg, po novom 1.2 kg."
                ],
                "fixed_bugs": []
            }
        },
        {
            "version": "1.2.19",
            "changes": {
                "news": [],
                "fixed_bugs": [
                    "Hot fix: Správne ukladanie štátu pri doručovacej adrese."
                ]
            }
        },
        {
            "version": "1.2.20",
            "changes": {
                "news": [
                    "Pridaná možnosť zmeniť vzhľad objednávok v nastaveniach na minimalistický.",
                    "Zobrazenie vývoja ceny naskladňovaného tovaru.",
                    "Možnosť vyhľadávať v objednávkach podľa mena alebo e-mailu zákazníka, prípadne podľa poznámky v objednávke.",
                    "Možnosť filtrovať objednávky podľa viacerých statusov.",
                    "Úprava navigácie v aplikácii pre rýchlejšiu prácu.",
                    "Zapamätanie stavu navigácie aj pri prepínaní medzi hlavnými sekciami (výroba/predaj a sklad).",
                    "Zobrazenie hmotnosti objednávky v gramoch, ak nepresiahne 10 kg. Ak presiahne, hmotnosť sa zobrazí v kilogramoch."
                ],
                "fixed_bugs": []
            }
        },
        {
            "version": "1.2.21",
            "changes": {
                "news": [
                    "Zobrazenie dátumu pri prejdení myšou nad čiaru v grafe vývoja ceny naskladňovaného tovaru."
                ],
                "fixed_bugs": [
                    "Opravená chyba, pri ktorej v niektorých prípadoch neboli správne vypočítané hodnoty v grafe zmien skladovej karty."
                ]
            }
        }
    ]
}
